tutorials/buoyantFoam/hotRoom/0/T.org
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    floor           
    {
        type            fixedValue;
        value           uniform 300;
    }

    ceiling         
    {
        type            fixedValue;
        value           uniform 300;
    }

    fixedWalls      
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
